# Challenge Questions - Employees Dataset

# Instructions:
• Please ensure you don't overwrite any existing cells. Add new cells below by pressing ALT+ENTER

• Attempt all of the questions

• You are encouraged to look online for help should you need it

# Dataset overview:
There are three csv files containing tables stored in the same directory as this Notebook, they are all related to each other:

• **employees.csv**: contains information about employees in a company. It contains their unique employee number (emp_no), their department number (dept_no), their hire date (hire_date) and their leaving date (leaving_date). The leaving date is blank if the employee is still employed by the company

• **departments.csv**: This contains information about the departments in a company. It contains the deparment number (dept_no), the department name (dept_name) and location.

• **salaries.csv**: This file contains the salaries of the employees. It contains a unique employee department key (emp_dept_key) and the salary. The emp_dept_key is in the format 'emp_id-dept_id'

#

## Import pandas, numpy and datetime

In [1]:
import pandas as pd
import numpy as np
import datetime as dt

## Load the files:
• "employees.csv" should be assigned to the variable **emp**

• "departments.csv" should be assigned to the variable **dept**

• "salaries.csv" should be assigned to the variable **sal**

In [6]:
emp = pd.read_excel(r"C:\Users\SAGAVERM\Desktop\DA dataset\employees.xlsx")
dept = pd.read_excel(r"C:\Users\SAGAVERM\Desktop\DA dataset\departments.xlsx")
sal = pd.read_excel(r"C:\Users\SAGAVERM\Desktop\DA dataset\salaries.xlsx")

## Check the head of all three DataFrames

In [7]:
emp.head()

   emp_no dept_no  hire_date leaving_date
0   10001      D5 2006-06-26          NaT
1   10002      D6 2005-11-21          NaT
2   10003      D4 2006-08-28          NaT
3   10004      D4 2006-12-01          NaT
4   10005      D3 2009-09-12          NaT

In [9]:
dept.head()

  dept_no                dept_name  location
0      D1   Accounting and Finance   Chicago
1      D2          Human Resources  New York
2      D3  Supply Chain Operations   Chicago
3      D4                Marketing  New York
4      D5               Technology   Chicago

In [10]:
sal.head()

  emp_dept_key  salary
0     10001-D5   30546
1     10002-D6   36536
2     10003-D4   38323
3     10004-D4   31851
4     10005-D3   53435

## Check the data types of all three DataFrames

In [60]:
emp.dtypes

emp_no          string[python]
dept_no         string[python]
hire_date       datetime64[ns]
leaving_date    datetime64[ns]
dtype: object

In [61]:
dept.dtypes

dept_no      string[python]
dept_name    string[python]
location     string[python]
dtype: object

In [26]:
sal.dtypes

emp_dept_key    string[python]
salary                   int64
dtype: object

## Change the data types accordingly. 

• emp_no, dept_no, dept_name, location, emp_depy_key should all be string data types

• hire_date and leaving_date should be datetime64

• salary should be int64

In [17]:
emp[['emp_no','dept_no']] = emp[['emp_no','dept_no']].astype('string')

In [22]:
dept[['dept_no','dept_name','location']] = dept[['dept_no','dept_name','location']].astype('string')

In [25]:
sal['emp_dept_key'] = sal['emp_dept_key'].astype('string')

## How many employees are currently working at the company. 

The employees still employed do not have a leaving date value. You can use the isnull() method to identify nulls or NaN values.

isnull(): https://pandas.pydata.org/docs/reference/api/pandas.isnull.html

In [34]:
emp['leaving_date'].isnull() #to return the bool value for null

0       True
1       True
2       True
3       True
4       True
       ...
995     True
996     True
997    False
998    False
999     True
Name: leaving_date, Length: 1000, dtype: bool

In [36]:
emp[emp['leaving_date'].isnull()== True].count()['emp_no'] #returns total employee

np.int64(741)

## How many currently employed people are there per department.

In [54]:
current_emp=emp[emp['leaving_date'].isnull()== True]

In [55]:
current_emp

    emp_no dept_no  hire_date leaving_date
0    10001      D5 2006-06-26          NaT
1    10002      D6 2005-11-21          NaT
2    10003      D4 2006-08-28          NaT
3    10004      D4 2006-12-01          NaT
4    10005      D3 2009-09-12          NaT
..     ...     ...        ...          ...
992  10900      D5 2015-09-07          NaT
993  10901      D2 2012-10-30          NaT
995  10903      D1 2009-02-14          NaT
996  10904      D5 2013-04-16          NaT
999  10906      D6 2014-01-20          NaT

[741 rows x 4 columns]

In [58]:
current_emp[['emp_no','dept_no']].groupby(by=['dept_no']).count()

         emp_no
dept_no
D1           84
D2           36
D3           94
D4          171
D5          188
D6          168

## Perform a left join on the emp and dept DataFrames (with emp as the left DF). Assign the result of this to the variable emp_dept

In [62]:
emp_dept = pd.merge(emp,dept,left_on='dept_no',right_on='dept_no', how='left')

In [63]:
emp_dept

    emp_no dept_no  hire_date leaving_date                dept_name  location
0    10001      D5 2006-06-26          NaT               Technology   Chicago
1    10002      D6 2005-11-21          NaT                    Sales   Chicago
2    10003      D4 2006-08-28          NaT                Marketing  New York
3    10004      D4 2006-12-01          NaT                Marketing  New York
4    10005      D3 2009-09-12          NaT  Supply Chain Operations   Chicago
..     ...     ...        ...          ...                      ...       ...
995  10903      D1 2009-02-14          NaT   Accounting and Finance   Chicago
996  10904      D5 2013-04-16          NaT               Technology   Chicago
997  10905      D4 2005-02-28   2006-03-07                Marketing  New York
998  10906      D2 2014-01-20   2021-04-25          Human Resources  New York
999  10906      D6 2014-01-20          NaT                    Sales   Chicago

[1000 rows x 6 columns]

## Perform a left join on the newly created "emp_dept" DataFrame and the "sal" DataFrame. 
## Assign this resulting DataFrame to the variable "emp_dept_sal"

• You will need to think about how to join the two tables. Note the emp_dept_key on the sal DataFrame is in the format 'emp_id-dept_id'

In [71]:
sal['emp_no'] = sal['emp_dept_key'].apply(lambda x : x[:5])

In [69]:
# #alternate method for above code
# sal['emp_no'] = sal['emp_dept_key'].apply(lambda x : x[:x.find('-')])

In [74]:
emp_dept_sal = pd.merge(emp_dept,sal, left_on='emp_no', right_on='emp_no',how = 'left')

## Drop the column "emp_dept_key"

In [75]:
emp_dept_sal.drop(columns='emp_dept_key', axis=0, inplace=True)

In [76]:
emp_dept_sal

,emp_no,dept_no,hire_date,leaving_date,dept_name,location,salary
0,10001,D5,2006-06-26,NaT,Technology,Chicago,30546
1,10002,D6,2005-11-21,NaT,Sales,Chicago,36536
2,10003,D4,2006-08-28,NaT,Marketing,New York,38323
3,10004,D4,2006-12-01,NaT,Marketing,New York,31851
4,10005,D3,2009-09-12,NaT,Supply Chain Operations,Chicago,53435
...,...,...,...,...,...,...,...
1183,10905,D4,2005-02-28,2006-03-07,Marketing,New York,32735
1184,10906,D2,2014-01-20,2021-04-25,Human Resources,New York,29095
1185,10906,D2,2014-01-20,2021-04-25,Human Resources,New York,97330
1186,10906,D6,2014-01-20,NaT,Sales,Chicago,29095
1187,10906,D6,2014-01-20,NaT,Sales,Chicago,97330

## What is the average salary per department?

In [81]:
emp_dept_sal[['dept_name','salary']].groupby(by=['dept_name']).mean()

                               salary
dept_name
Accounting and Finance   52148.887324
Human Resources          44849.602740
Marketing                41540.041985
Sales                    59192.053640
Supply Chain Operations  45183.788462
Technology               58975.979592

In [82]:
pd.pivot_table(data = emp_dept_sal, index= 'dept_name', values= 'salary', aggfunc='mean')

                               salary
dept_name
Accounting and Finance   52148.887324
Human Resources          44849.602740
Marketing                41540.041985
Sales                    59192.053640
Supply Chain Operations  45183.788462
Technology               58975.979592

## What is the average salary by location?

In [79]:
emp_dept_sal[['salary','location']].groupby(by='location').mean()

                salary
location
Chicago   55383.208675
New York  42261.229851

In [83]:
pd.pivot_table(data = emp_dept_sal, index = 'location', values='salary', aggfunc='mean')

                salary
location
Chicago   55383.208675
New York  42261.229851

## How many people were hired each year in each of the last 10 years?

In [91]:
emp_dept_sal.head(2)

,emp_no,dept_no,hire_date,leaving_date,dept_name,location,salary,hire_Year
0,10001,D5,2006-06-26,NaT,Technology,Chicago,30546,2006
1,10002,D6,2005-11-21,NaT,Sales,Chicago,36536,2005

In [90]:
emp_dept_sal['hire_Year'] = emp_dept_sal['hire_date'].dt.strftime('%Y')

In [93]:
emp_dept_sal['hire_Year'].sort_values(ascending=True)

593    2005
723    2005
720    2005
144    2005
699    2005
       ...
387    2019
896    2019
389    2019
390    2019
388    2019
Name: hire_Year, Length: 1188, dtype: object

In [95]:
emp_dept_sal[['emp_no','hire_Year']].groupby(by='hire_Year').count().tail(10)

           emp_no
hire_Year
2010          146
2011           99
2012           81
2013           61
2014           69
2015           39
2016           40
2017           14
2018            8
2019            7